bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
  if (request->authenticate(WEB_AUTH_USERNAME, WEB_AUTH_PASSWORD)) {
    return true;
  }

  request->requestAuthentication();
  return false;
}

void initFileSystem() {
  // First attempt: try to mount without formatting
  if (LittleFS.begin(false)) {
    Serial.println("LittleFS mounted successfully");
    return;
  }

  Serial.println("LittleFS mount failed, attempting format...");

  // If mount fails, explicitly format the filesystem first
  // This handles severely corrupted filesystems better than begin(true)
  if (!LittleFS.format()) {
    Serial.println("LittleFS format failed! Check partition table and flash configuration.");
    return;
  }

  Serial.println("LittleFS formatted successfully");

  // Now try to mount the freshly formatted filesystem
  if (!LittleFS.begin(false)) {
    Serial.println("Critical: Failed to mount LittleFS after successful format!");
    return;
  }

  Serial.println("LittleFS mounted successfully after format");
}

bool connectToMeshCore() {
  lastMeshConnectAttempt = millis();
  meshDeviceConnected = false;
  meshMessageCharacteristic = nullptr;
  meshChannelReady = false;

  Serial.printf("Scanning for MeshCore peer named '%s' (extended debug)...\n", BLE_PEER_NAME);

  BLEScan* scan = BLEDevice::getScan();
  scan->setActiveScan(true);

  const int scanSeconds = 10;
  BLEScanResults results = scan->start(scanSeconds, false);

  Serial.printf("Scan complete: %d devices found\n", results.getCount());

  for (int i = 0; i < results.getCount(); i++) {
    BLEAdvertisedDevice device = results.getDevice(i);

    // Debug: print what we saw for each advertiser
    std::string rawName = device.getName();
    String devName = rawName.length() ? String(rawName.c_str()) : String("");
    String devAddr = String(device.getAddress().toString().c_str());
    int rssi = device.getRSSI();
    Serial.printf("  [%d] Name='%s' Addr=%s RSSI=%d\n", i, devName.c_str(), devAddr.c_str(), rssi);

    // Print any advertised single service UUID (if present)
    bool svcPrinted = false;
    if (device.haveServiceUUID()) {
      BLEUUID adv = device.getServiceUUID();
      Serial.printf("       Advertised service UUID: %s\n", adv.toString().c_str());
      svcPrinted = true;
    }
    if (!svcPrinted) {
      Serial.println("       No single advertised service UUID available");
    }

    // Matching logic: exact name, substring, or advertised service UUID match
    bool nameMatches = (devName.length() && devName == String(BLE_PEER_NAME));
    bool nameContains = (devName.length() && devName.indexOf(String(BLE_PEER_NAME)) >= 0);
    bool serviceMatches = false;

    if (device.haveServiceUUID()) {
      BLEUUID adv = device.getServiceUUID();
      // Compare to configured MeshCore UUID (safe regardless of how MESHCORE_SERVICE_UUID is defined)
      serviceMatches = adv.equals(BLEUUID(MESHCORE_SERVICE_UUID));
    }

    if (!(nameMatches || nameContains || serviceMatches)) {
      Serial.println("       Not the MeshCore peer (name/service mismatch), skipping.");
      continue;
    }

    Serial.println("MeshCore peer candidate found, attempting connection...");

    if (meshClient == nullptr) {
      meshClient = BLEDevice::createClient();
      meshClient->setClientCallbacks(new MeshClientCallbacks());
    }

    if (!meshClient->connect(&device)) {
      lastMeshError = "Connection attempt failed";
      Serial.println("Connection attempt failed");
      continue;
    }

    // Allow MTU negotiation to complete before accessing services
    delay(BLE_MTU_NEGOTIATION_DELAY_MS);

    // Retry service discovery to handle cases where MTU negotiation may still be completing
    BLERemoteService* service = nullptr;
    for (int retry = 0; retry < BLE_SERVICE_DISCOVERY_RETRIES; retry++) {
      service = meshClient->getService(MESHCORE_SERVICE_UUID);
      if (service != nullptr) {
        break;
      }
      if (retry < BLE_SERVICE_DISCOVERY_RETRIES - 1) {
        Serial.printf("Service discovery attempt %d failed, retrying...\n", retry + 1);
        delay(BLE_SERVICE_DISCOVERY_RETRY_DELAY_MS);
      }
    }
    if (service == nullptr) {
      lastMeshError = "MeshCore service not found on peer";
      Serial.println("MeshCore service not found on peer, disconnecting...");
      meshClient->disconnect();
      continue;
    }

    BLERemoteCharacteristic* characteristic = service->getCharacteristic(MESHCORE_MESSAGE_CHAR_UUID);
    if (characteristic == nullptr) {
      lastMeshError = "MeshCore message characteristic missing";
      Serial.println("MeshCore message characteristic missing, disconnecting...");
      meshClient->disconnect();
      continue;
    }

    if (!characteristic->canWrite()) {
      lastMeshError = "MeshCore message characteristic is not writable";
      Serial.println("MeshCore message characteristic is not writable, disconnecting...");
      meshClient->disconnect();
      continue;
    }

    meshMessageCharacteristic = characteristic;
    meshDeviceConnected = true;
    lastMeshError = "";
    Serial.println("Connected to MeshCore peer and ready to send messages");

    if (!ensureMeshChannel()) {
      Serial.println("ensureMeshChannel() failed, disconnecting...");
      meshClient->disconnect();
      meshDeviceConnected = false;
      return false;
    }

    return true;
  }

  lastMeshError = "MeshCore peer not found during scan";
  Serial.println(lastMeshError.c_str());
  return false;
}
void disconnectFromMeshCore() {
  // Clean up the BLE client properly before deinit
  if (meshClient != nullptr) {
    if (meshClient->isConnected()) {
      Serial.println("Disconnecting from MeshCore...");
      meshClient->disconnect();
    }
    // Delete the client to properly deregister it from BLE stack
    delete meshClient;
    meshClient = nullptr;
  }
  
  meshDeviceConnected = false;
  meshMessageCharacteristic = nullptr;
  meshChannelReady = false;
  
  // Only deinitialize BLE if it was initialized
  if (bleInitialized) {
    delay(BLE_DEINIT_CLEANUP_DELAY_MS);
    BLEDevice::deinit();
    bleInitialized = false;
    Serial.println("BLE deinitialized");
  }
}

